# MySQL Workbench

**1. Create Database**

    CREATE DATABASE file_name;

**2. Drop Database**

    DROP DATABASE file_name;

**3. Use a Database**

    --use a specific Database

**4. Create a Table**

    CREATE TABLE table_name (
        column 1 data_type,
        column 2 data_type,
        column 3 data_type
        );

**5. Insert Data In Table**

    INSERT INTO table_name;

**6. Make a Comment**

    --This is a Comment

**7. Add/ Drop & Alter Columns**

    ALTER TABLE table_name
    ADD column_name data_type;
    DROP column_name;

**8. Show Tables**

    SHOW TABLES;

**9. Insert Record**

    INSERT INTO table_name (column 1, column 2,column 3)
    VALUES (value 1, value 2, value 3 now());

**10. Insert Multiple Records**

    INSERT INTO table_name (column 1, column 2, column 3)
    VALEUES (value 1, value 2, value 3 now()), ( value 4, value 5, value 6 now()), (value 7, value 8, value 9 now());

**11. Select Table**

    SELECT * FROM table_name;

**12. Select Columns**

    SELECT * FROM table_name;
    SELECT column 1 FROM table_name;

**13. Drop Exists Table**

    DROP DATABADSE IF EXISTS table_name;

**14. Where Condition**

    SELECT * FROM INFO
    WHERE column_name condition;

**15. Order By (Sort)**

    SELECT * FROM INFO
    ORDER BY column_name DESC/ ASC;

**16. Select Operation:** 
 *It can perform mathematical operation on a specific column and entry its information in a new column that it creates.*

  Example:
  
      SELECT first_name,
             last_name,
             score * 10 AS final;

$$point:$$ Here we say that it will score * 10 and it will save the information in the score * 10  column.
If you want to change the column name, you should use AS. Here we want to replace the final column instead of score * 10.

**17. Delete Record**

    DELETE FROM table_name WHERE column_name (your condition);

**18. Modify Column**

    ALTER TABLE table_name MODIFY CLOUMN column_name data_type;

**19. Concat**

    SELECT CONCAT ('word 1', ' ', 'word 2') AS new_column_name, dept FROM table_name;

**20. Functions In DB:**  *Count, Sum, Avg, Combine*

$$1.COUNT$$

*1. View all values EVEN duplicate values:*

    SELECT COUNT (*) FROM table_name;
    
*2. View non-null values in a column:*

    SELECT COUNT (column_name) FROM table_name;

*3. Composition Count & Distinct:*

    SELECT COUNT (DISTINCT (column_name)) FROM table_name;

$$point:$$

$$In this section, null values are not counted,$$
$$And duplicate data is counted once!!$$

$$2. SUM$$

*1. Toal column:*

    SELECT SUM (column_name) FROM table_name;

*2. Choose a new name for the SUM column:*

    SELECT SUM (column_name) AS new_name FROM table_name;

*3. Condition for sum:*

    SELECT SUM (column_name) FROM table_name
    WHERE condition;

$$3. AVG$$

*AVG:*

    SELECT AVG (column_name) FROM tanle_name;

*Example:*

    SELECT customer FROM orders
    WHERE orderprice > (SELECT AVG (orderprice) FROM orders);

$$4. COMBINE$$

**Combine:** *It unites 2 queries, and we can see the result 2 tables in one.*

    SELECT column 1, column 2, ...
    FROM table_name 1
    UNION
    SELECT column 1, column 2, ...
    FROM table_name 2;

$$Other Functions$$

**21. Length:** *Show the length of a string.*

    SELECT LENGTH ('STRING') AS lengthofstring;

**22. Lcase:** *Lower case characters of a string.*

    SELECT LCASE ('STRING') AS lowercasetext;

**23. Ucase:** *Upper case characters of a string.*

    SELECT UCASE ('STRING') AS uppercasetext;

$$Question:$$

*How can we make sure, we haven't entered duplicate record information?*

    INSERT INTO table_name 1
        (table_name 1- column 1, table_name 1- column 2, ...)
    SELECT table_name 2- column 1 AS table_name 1- column 1, ...
    FROM table_name 2
    WHERE NOT EXISTS (SELECT * FROM table_name 1
                      WHERE table_name 1. column 1 = table_name 2. column 2;

**24. Between (Select Range)**

    SELECT * FROM table_name WHERE column_name BETWEEN value1 AND value2;

$$Examples:$$

**25. New Table With Foreign Key (Posts)**

    CREATE TABLE posts (
        user_id INT,
        title VARCHAR(20),
        publish_date DATETIME DEFAULT CURRENT_TIMESTAMP,
        PRIMARY KEY (id),
        FOREIGN KEY (user_id) REFRENCES users(id)
    );

**26. New Table With 2 Foriegn Keys**

    CREATE TABLE comments (
        id INT AUTO_INCREMENT,
        post_id INT,
        user_id INT,
        publish_date DATETIME DEFAULT CURRENT_TIMESTAMP,
        PRIMARY KEY (id),
        FOREIGN KEY (user_id) REFRENCES users(id),
        FOREIGN KEY (post_id) REFRENCES posts(id)
    );

**27. Aggregate Functions**

     SELECT COUNT(id) FROM users,
     SELECT MAX(age) FROM users;
     SELECT MIN(age) FROM users;
     SELECT SUM(age) FROM users;
     SELECT UCASE(first_name), LCASE(last_name) FROM users;

**28. Group By**

     SELECT age, COUNT(age) FROM users GROUP BY age;
     SELECT age, COUNT(age) FROM users WHERE age > 20 GROUP BY age;
     SELECT age, COUNT(age) FROM users GROUP BY age HAVING count(age) >= 2;

**29. Like (Searching)**

    SELECT * FROM users WHERE dept LIKE 'd%';
    SELECT * FROM users WHERE dept LIKE 'dev%';
    SELECT * FROM users WHERE dept LIKE '%t';
    SELECT * FROM users WHERE dept LIKE '%e%';

**30. Not Like**

    SELECT * FROM users WHERE dept NOT LIKE 'd%';

**31. Create & Remove Index**

$$CREATE$$
     CREATE INDEX LIndex ON users(location);

$$DROP$$
     DROP INDEX LIndex ON users;

**32. Locate (Position)**

    SELECT column1, POSITION ('X' IN column2)
    FROM table_name;